In [1]:
import pandas as pd
import numpy as np

In [3]:
dframe1 = pd.DataFrame(np.arange(8).reshape(2,4),
                      index=pd.Index(['LA', 'SF'], name='cities'),
                      columns=pd.Index(['A', 'B', 'C', 'D'], name='letters'))

In [4]:
dframe1

letters  A  B  C  D
cities
LA       0  1  2  3
SF       4  5  6  7

In [5]:
dframe_st = dframe1.stack()

dframe_st

cities  letters
LA      A          0
        B          1
        C          2
        D          3
SF      A          4
        B          5
        C          6
        D          7
dtype: int64

In [6]:
dframe_st.unstack()

letters  A  B  C  D
cities
LA       0  1  2  3
SF       4  5  6  7

In [7]:
dframe_st.unstack('letters')

letters  A  B  C  D
cities
LA       0  1  2  3
SF       4  5  6  7

In [8]:
dframe_st.unstack('cities')

cities   LA  SF
letters
A         0   4
B         1   5
C         2   6
D         3   7

In [9]:
type(dframe_st)

pandas.core.series.Series

In [12]:
ser1 = pd.Series([0,1,2], index=['Q', 'X', 'Y'])

ser2 = pd.Series([4,5,6], index=['X', 'Y', 'Z'])

In [21]:
dframe = pd.concat([ser1, ser2], keys=['Alpha', 'Beta'])

In [22]:
dframe

Alpha  Q    0
       X    1
       Y    2
Beta   X    4
       Y    5
       Z    6
dtype: int64

In [28]:
dframe.unstack()

         Q    X    Y    Z
Alpha  0.0  1.0  2.0  NaN
Beta   NaN  4.0  5.0  6.0

In [33]:
dframe.index

MultiIndex(levels=[[u'Alpha', u'Beta'], [u'Q', u'X', u'Y', u'Z']],
           labels=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 1, 2, 3]])

In [34]:
dframe_st

cities  letters
LA      A          0
        B          1
        C          2
        D          3
SF      A          4
        B          5
        C          6
        D          7
dtype: int64

In [35]:
dframe_st.index

MultiIndex(levels=[[u'LA', u'SF'], [u'A', u'B', u'C', u'D']],
           labels=[[0, 0, 0, 0, 1, 1, 1, 1], [0, 1, 2, 3, 0, 1, 2, 3]],
           names=[u'cities', u'letters'])

In [36]:
dframe.index.names = ['Level', 'Letters']

In [37]:
dframe.unstack('Level')

Level    Alpha  Beta
Letters
Q          0.0   NaN
X          1.0   4.0
Y          2.0   5.0
Z          NaN   6.0

In [38]:
dframe

Level  Letters
Alpha  Q          0
       X          1
       Y          2
Beta   X          4
       Y          5
       Z          6
dtype: int64

In [39]:
dframe.unstack('Letters')

Letters    Q    X    Y    Z
Level
Alpha    0.0  1.0  2.0  NaN
Beta     NaN  4.0  5.0  6.0